andoma/mios/src/platform/stm32g4/stm32g4_usb.c
#include "stm32g4_usb.h"

#include "stm32g4_clk.h"
#include "stm32g4_reg.h"


#include <mios/io.h>
#include <mios/sys.h>
#include "irq.h"

#include <usb/usb.h>
#include <usb/usb_desc.h>

#include <sys/param.h>

#include <assert.h>
#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>

#define USB_BASE 0x40005c00
#define USB_SRAM 0x40006000


#define USB_EPnR(x) (USB_BASE + (x) * 4)
#define USB_CNTR    (USB_BASE + 0x40)
#define USB_ISTR    (USB_BASE + 0x44)
#define USB_FNR     (USB_BASE + 0x48)
#define USB_DADDR   (USB_BASE + 0x4c)
#define USB_BTABLE  (USB_BASE + 0x50)
#define USB_LPMCSR  (USB_BASE + 0x54)
#define USB_BCDR    (USB_BASE + 0x58)


#define USB_ADDR_TX(x)  (USB_SRAM + (x) * 8 + 0)
#define USB_COUNT_TX(x) (USB_SRAM + (x) * 8 + 2)
#define USB_ADDR_RX(x)  (USB_SRAM + (x) * 8 + 4)
#define USB_COUNT_RX(x) (USB_SRAM + (x) * 8 + 6)

#define MAX_NUM_ENDPOINTS 8

#define EP_TYPE_BULK      0
#define EP_TYPE_CONTROL   1
#define EP_TYPE_ISO       2
#define EP_TYPE_INTERRUPT 3




typedef struct usb_tx_ptr {
  const void *ptr;
  uint8_t (*getch)(void *opaque);
  uint16_t offset;
  uint16_t total;
  uint8_t zlp;
} usb_tx_ptr_t;


typedef struct ep0_in {
  usb_ep_t ue;
  usb_tx_ptr_t tp;
} ep0_in_t;


typedef struct ep0_out {
  usb_ep_t ue;
} ep0_out_t;


typedef struct usb_dev {
  device_t ud_dev;

  struct usb_device_descriptor ud_desc;
  const char *ud_manufacturer;
  const char *ud_product;
  uint8_t ud_serial_number[6]; // see stm32g4_usb_create()
  uint8_t *ud_config_desc;
  size_t ud_config_desc_size;
} usb_dev_t;


typedef struct usb_ctrl {

  usb_dev_t uc_ud;

  usb_ep_t *uc_ue[2][MAX_NUM_ENDPOINTS];  // for [2]  0=IN, 1=OUT

  uint16_t uc_epreg[MAX_NUM_ENDPOINTS];

  uint8_t uc_pending_daddr;

  ep0_in_t uc_ep0_in;   // TX
  ep0_out_t uc_ep0_out; // RX

  uint8_t *rxbuf[MAX_NUM_ENDPOINTS];
  uint8_t *txbuf[MAX_NUM_ENDPOINTS];
  uint8_t txsiz[MAX_NUM_ENDPOINTS];

  // Double-buffered TX state: second PMA buffer and number of filled
  // buffers (0-2). DTOG==SW_BUF encodes both "empty" and "both full,
  // one in flight", so occupancy must be tracked in software:
  // incremented on write, decremented on CTR_TX.
  uint8_t *txbuf1[MAX_NUM_ENDPOINTS];
  uint8_t uc_txq[MAX_NUM_ENDPOINTS];

  struct usb_interface_queue uc_ifaces;

} usb_ctrl_t;


static const char *
typestr(uint16_t epnr)
{
  uint16_t type = (epnr >> 9) & 3;
  uint16_t kind = epnr & 0x100;

  switch(type) {
  case 0:
    return kind ? "DBL_BUF" : "BULK";
  case 1:
    return kind ? "CTRL-ONLY" : "CTRL";
  case 2:
    return "ISO";
  case 3:
    return "INTERRUPT";
  }
  return "???";
}

static const char *statbits(int n)
{
  switch(n) {
  case 0: return "Off";
  case 1: return "Stall";
  case 2: return "Nak";
  case 3: return "Valid";
  default: return "???";
  }
}


static void
write_epnr(int ea, uint16_t value)
{
  reg_wr16(USB_EPnR(ea), value);
}


static void
handle_ctr(usb_ctrl_t *uc, uint16_t istr)
{
  const int epa = istr & 0xf;
  if(epa >= MAX_NUM_ENDPOINTS)
    return;

  uint16_t epnr = reg_rd16(USB_EPnR(epa));

  if(epnr & 0x8000) {
    write_epnr(epa, uc->uc_epreg[epa] & ~(1 << 15)); // Clear CTR_RX
    // RX (OUT from host point-of-view)
    usb_ep_t *ep = uc->uc_ue[1][epa];
    if(ep != NULL && !(ep->ue_address & 0x80)) {
      const int len = reg_rd16(USB_COUNT_RX(epa)) & 0x3ff;
      const int is_setup = (epnr >> 11) & 1;
      ep->ue_completed(&uc->uc_ud.ud_dev, ep, len, is_setup);
    }
  }

  if(epnr & 0x80) {
    // TX completed (IN from host point-of-view)

    write_epnr(epa, uc->uc_epreg[epa] & ~(1 << 7)); // Clear CTR_TX

    usb_ep_t *ep = uc->uc_ue[0][epa];

    if(ep != NULL && ep->ue_dbl_buf) {
      __atomic_fetch_sub(&uc->uc_txq[epa], 1, __ATOMIC_RELAXED);

      // The first transaction after DBL_BUF is set still runs normal
      // flow control and drops STAT to NAK; restore VALID once.
      const uint16_t cur = reg_rd16(USB_EPnR(epa));
      const uint16_t stat = (cur >> 4) & 3;
      if(stat != 3)
        write_epnr(epa, uc->uc_epreg[epa] | ((stat ^ 3) << 4));
    }

    if(ep != NULL && ep->ue_completed) {
      ep->ue_completed(&uc->uc_ud.ud_dev, ep, 0, 0);
    }
  }
}


static void
tx_start(usb_ctrl_t *uc, int ea, usb_tx_ptr_t *tx, int max_packet_size)
{
  uint16_t *dst16 = (uint16_t *)uc->txbuf[ea];

  assert(tx != NULL);
  assert(tx->getch != NULL);
  assert(tx->ptr != NULL);

  int len = MIN(max_packet_size, tx->total - tx->offset);
  reg_wr16(USB_COUNT_TX(ea), len);
  while(len > 1) {
    uint8_t a = tx->getch(tx);
    uint8_t b = tx->getch(tx);
    uint16_t u16 = (b << 8) | a;
    *dst16++ = u16;
    len -= 2;
  }

  if(len) {
    uint8_t a = tx->getch(tx);
    *dst16++ = a;
  }

  write_epnr(ea, uc->uc_epreg[ea] | (1 << 4)); // TX: NAK -> VALID
}

static void
send_zlp(usb_ctrl_t *uc, int ea)
{
  reg_wr16(USB_COUNT_TX(ea), 0);
  write_epnr(ea, uc->uc_epreg[ea] | (1 << 4)); // TX: NAK -> VALID
}


static void
ep0_txco(device_t *d, usb_ep_t *ue, uint32_t bytes, uint32_t flags)
{
  usb_ctrl_t *uc = (usb_ctrl_t *)d;
  usb_tx_ptr_t *tp = &uc->uc_ep0_in.tp;


  if(uc->uc_pending_daddr) {
    reg_wr(USB_DADDR, uc->uc_pending_daddr);
    uc->uc_pending_daddr = 0;
  }

  if(tp->ptr == NULL)
    return;

  if(tp->offset != tp->total) {
    tx_start(uc, 0, tp, 8);
  } else if(tp->zlp) {
    tp->zlp = 0;
    send_zlp(uc, 0);
  } else {
    tp->ptr = NULL;
  }
}

uint8_t
read_tx_ptr(void *opaque)
{
  usb_tx_ptr_t *tp = opaque;
  const uint8_t *data = tp->ptr;
  return data[tp->offset++];
}


uint8_t
read_string_as_desc(void *opaque)
{
  usb_tx_ptr_t *tp = opaque;
  int chof;
  uint8_t r;
  const uint8_t *data = tp->ptr;

  switch(tp->offset) {
  case 0:
    r = tp->total;
    break;
  case 1:
    r = USB_DESC_TYPE_STRING;
    break;
  default:
    chof = (tp->offset - 2) / 2;
    if(tp->offset & 1) {
      r = 0;
    } else {
      r = data[chof];
    }
    break;
  }
  tp->offset++;
  return r;
}


uint8_t
read_bin2hex_as_desc(void *opaque)
{
  usb_tx_ptr_t *tp = opaque;
  int chof;
  uint8_t r;
  const uint8_t *data = tp->ptr;

  switch(tp->offset) {
  case 0:
    r = tp->total;
    break;
  case 1:
    r = USB_DESC_TYPE_STRING;
    break;
  default:
    chof = (tp->offset - 2) / 2;
    if(tp->offset & 1) {
      r = 0;
    } else {
      const uint8_t byte_idx = chof / 2;
      const uint8_t b = data[byte_idx] >> (chof & 1 ? 0 : 4);
      r = "0123456789ABCDEF"[b & 0xf];
    }
    break;
  }
  tp->offset++;
  return r;
}



static void
handle_get_descriptor(usb_dev_t *ud, const struct usb_setup_packet *usp,
                      usb_tx_ptr_t *tp)
{
  const uint8_t type = usp->value >> 8;
  const uint8_t index = usp->value;

