andoma/mios/src/platform/stm32g4/stm32g4_usb.c
  const void *desc = NULL;
  size_t desclen = 0;

  uint8_t (*getch)(void *opaque) = read_tx_ptr;

  switch(type) {

  case USB_DESC_TYPE_DEVICE:
    if(index != 0)
      break;
    desc = &ud->ud_desc;
    desclen = sizeof(struct usb_device_descriptor);
    break;

  case USB_DESC_TYPE_CONFIGURATION:
    if(index != 0)
      break;
    desc = ud->ud_config_desc;
    desclen = ud->ud_config_desc_size;
    break;

  case USB_DESC_TYPE_STRING:

    getch = read_string_as_desc;
    switch(index) {
    case 0:
      desc = "\x09\x04";
      desclen = 2;
      break;
    case 1:
      desc = ud->ud_manufacturer;
      desclen = strlen(desc);
      break;
    case 2:
      desc = ud->ud_product;
      desclen = strlen(desc);
      break;
    case 3:
      getch = read_bin2hex_as_desc;
      desc = ud->ud_serial_number;
      desclen = sizeof(ud->ud_serial_number) * 2;
      break;
    }
    desclen = desclen * 2 + 2;
    break;

  default:
    break;
  }

  tp->offset = 0;

  if(desc == NULL) {
    send_zlp((usb_ctrl_t *)ud, 0);
    return;
  }

  const int reqlen = usp->length;

  tp->ptr = desc;
  tp->getch = getch;
  tp->total = MIN(reqlen, desclen);
  tp->zlp = 0;

  // If the descriptor is shorter then asked for and is a multiple of 8
  // we must add a trailing ZLP
  if(desclen < reqlen && !(desclen & 7))
    tp->zlp = 1;

  tx_start((usb_ctrl_t *)ud, 0, tp, 8);
}


static void
enable_endpoints(usb_ctrl_t *uc)
{
  for(int ea = 1; ea < MAX_NUM_ENDPOINTS; ea++) {
    int bits = 0;
    usb_ep_t *in  = uc->uc_ue[0][ea];
    usb_ep_t *out = uc->uc_ue[1][ea];
    if(out == in)
      out = NULL;  // Double-buffered IN reserves the OUT slot

    if(out) {
      bits |= (3 << 12);  // RX: OFF -> VALID
    }

    if(in) {
      if(in->ue_dbl_buf) {
        // TX: VALID regardless of current state, DTOG_TX/SW_BUF -> 0
        const uint16_t cur = reg_rd16(USB_EPnR(ea));
        bits |= ((((cur >> 4) & 3) ^ 3) << 4);
        bits |= cur & ((1 << 6) | (1 << 14));
        uc->uc_txq[ea] = 0;
      } else {
        bits |= (2 << 4);  // TX: OFF -> NAK
      }
    }

    write_epnr(ea, uc->uc_epreg[ea] | bits);

    if(in) {
      in->ue_running = 1;
      if(in->ue_reset)
        in->ue_reset(&uc->uc_ud.ud_dev, in);
    }
    if(out) {
      out->ue_running = 1;
      if(out->ue_reset)
        out->ue_reset(&uc->uc_ud.ud_dev, out);
    }
  }
}

static void
reset_endpoints(usb_ctrl_t *uc)
{
  for(int ea = 1; ea < MAX_NUM_ENDPOINTS; ea++) {
    usb_ep_t *in  = uc->uc_ue[0][ea];
    usb_ep_t *out = uc->uc_ue[1][ea];
    if(out == in)
      out = NULL;  // Double-buffered IN reserves the OUT slot

    uc->uc_txq[ea] = 0;

    if(in) {
      in->ue_running = 0;
      if(in->ue_reset)
        in->ue_reset(&uc->uc_ud.ud_dev, in);
    }
    if(out) {
      out->ue_running = 0;
      if(out->ue_reset)
        out->ue_reset(&uc->uc_ud.ud_dev, out);
    }
  }
}


static void
ep0_handle_setup(usb_ctrl_t *uc, const struct usb_setup_packet *usp)
{
  usb_tx_ptr_t *tp = &uc->uc_ep0_in.tp;
  const int recipient = usp->request_type & 0x1f;
  const int type = (usp->request_type >> 5) & 3;

  if(type == 0 && recipient == 0) {

    switch(usp->request) {
    case USB_REQ_GET_STATUS:
      send_zlp(uc, 0);
      break;

    case USB_REQ_SET_ADDRESS:
      send_zlp(uc, 0);
      uc->uc_pending_daddr = 0x80 | usp->value;
      break;

    case USB_REQ_GET_DESCRIPTOR:
      handle_get_descriptor(&uc->uc_ud, usp, tp);
      break;

    case USB_REQ_SET_CONFIG:
      send_zlp(uc, 0);
      enable_endpoints(uc);
      break;

    default:
      panic("Can't handle setup %d",
            usp->request);
    }
    return;
  }

  if(type == 1 && recipient == 1) {

    usb_interface_t *ui;
    STAILQ_FOREACH(ui, &uc->uc_ifaces, ui_link) {
      if(ui->ui_index == usp->index && ui->ui_iface_cfg) {
        ui->ui_iface_cfg(ui->ui_opaque, usp->request, usp->value);
      }
    }
  }
  send_zlp(uc, 0);
}



static void
ep0_rx(device_t *d, usb_ep_t *ue, uint32_t bytes, uint32_t flags)
{
  usb_ctrl_t *uc = (usb_ctrl_t *)d;
  struct usb_setup_packet *usp = (struct usb_setup_packet *)uc->rxbuf[0];

  if(bytes == 8) {
    ep0_handle_setup(uc, usp);
  }
  write_epnr(0, uc->uc_epreg[0] | (1 << 12)); // RX: NAK -> VALID
}



static usb_ctrl_t g_usb_ctrl = {
  .uc_ud = {
    .ud_desc = {
      .bLength            = sizeof(struct usb_device_descriptor),
      .bDescriptorType    = USB_DESC_TYPE_DEVICE,
      .bcdUSB             = 0x200,
      .bDeviceClass       = 0xef,
      .bDeviceSubClass    = 0x02,
      .bDeviceProtocol    = 0x01,
      .bMaxPacketSize0    = 8,
      .bcdDevice          = 0x100,
      .iManufacturer      = 1,
      .iProduct           = 2,
      .iSerialNumber      = 3,
      .bNumConfigurations = 1,
    },
  },

  .uc_ue[0][0] = &g_usb_ctrl.uc_ep0_in.ue,
  .uc_ue[1][0] = &g_usb_ctrl.uc_ep0_out.ue,
  .uc_epreg[0] = EP_TYPE_CONTROL << 9 | (1 << 15) | (1 << 7) | (1 << 8),

  .uc_ep0_in = {
    .ue = {
      .ue_iface_aux = &g_usb_ctrl.uc_ep0_in,
      .ue_completed = ep0_txco,
      .ue_name = "ep0",
    }
  },

  .uc_ep0_out = {
    .ue = {
      .ue_iface_aux = &g_usb_ctrl.uc_ep0_out,
      .ue_completed = ep0_rx,
      .ue_name = "ep0",
    }
  }
};

void
irq_19(void) // High prio interrupts: CTR for iso/double-buffered bulk only
{
  uint16_t irq = reg_rd(USB_ISTR);
  if(irq & 0x8000)
    handle_ctr(&g_usb_ctrl, irq);
}

void
irq_20(void) // Low prio interrupts
{
  uint16_t irq = reg_rd(USB_ISTR);
  if(irq & 0x400) {
    usb_ctrl_t *uc = &g_usb_ctrl;
    uc->uc_pending_daddr = 0;
    reset_endpoints(uc);
    reg_wr(USB_ISTR, ~0x400);
    // Reset EP0
    reg_wr16(USB_EPnR(0),
             (3 << 12) |  // RX: VALID
             (1 << 9) |   // CONTROL
             (2 << 4) |  // TX: NAK
             0);
    reg_wr(USB_DADDR, 0x80); // Set EF, addr=0
  } else if(irq & 0x8000) {
    // Correct Transfer
    handle_ctr(&g_usb_ctrl, irq);
  } else if(irq & 0x800) {
    // Suspend
    reg_wr(USB_ISTR, ~0x800);
    reg_set_bit(USB_CNTR, 3);
    reg_set_bit(USB_CNTR, 2);
  } else if(irq & 0x1000) {
    // Wakeup
    reg_wr(USB_ISTR, ~0x1000);
    reg_clr_bit(USB_CNTR, 2);
    reg_clr_bit(USB_CNTR, 3);
  }
}


static void
usb_print_info(struct device *d, struct stream *st)
{
  struct usb_ctrl *uc = (struct usb_ctrl *)d;

  const uint16_t cntr = reg_rd(USB_CNTR);
  stprintf(st, "Frontend: %s\n",
           (cntr & 2) ? "Off" : "On");

  const uint16_t fnr = reg_rd(USB_FNR);
  stprintf(st, "RXDP:%d RXDM:%d Locked:%d Lost SOF:%d Frame:%d\n",
           (fnr >> 15) & 1,
           (fnr >> 14) & 1,
           (fnr >> 13) & 1,
           (fnr >> 11) & 3,
           (fnr >> 0) & 0x7ff);
  const uint16_t daddr = reg_rd(USB_DADDR);
  stprintf(st, "Enable: %d  Assigned Address: %d\n",
           (daddr >> 7) & 1,
           daddr & 0x7f);

  stprintf(st, "IN Endpoints (TX)\n");
  for(size_t i = 0; i < MAX_NUM_ENDPOINTS; i++) {
    const uint16_t epnr = reg_rd(USB_EPnR(i));

    stprintf(st, "  %d %-9s %-5s IRQ:%d Dtog:%d | ",
             i,
             typestr(epnr),
             statbits((epnr >> 4) & 3),
             (epnr >> 7) & 1,
             (epnr >> 6) & 1);

    usb_ep_t *ue = uc->uc_ue[0][i];
    if(ue != NULL) {
      stprintf(st, "%-10u %-10u %s",
               ue->ue_num_packets,
               ue->ue_num_drops,
               ue->ue_name);
      ue->ue_num_packets = 0;
      ue->ue_num_drops = 0;
    }
    stprintf(st, "\n");
  }

  stprintf(st, "\nOUT Endpoints (RX)\n");
  for(size_t i = 0; i < MAX_NUM_ENDPOINTS; i++) {
    const uint16_t epnr = reg_rd(USB_EPnR(i));

    stprintf(st, "  %d %-9s %-5s Irq:%d Dtog:%d | ",
             i,
             typestr(epnr),
             statbits((epnr >> 12) & 3),
             (epnr >> 15) & 1,
             (epnr >> 14) & 1);

