andoma/mios/src/platform/stm32g4/stm32g4_usb.c
    usb_ep_t *ue = uc->uc_ue[1][i];
    if(ue != NULL) {
      stprintf(st, "%-10u %-10u %s",
               ue->ue_num_packets,
               ue->ue_num_drops,
               ue->ue_name);
      ue->ue_num_packets = 0;
      ue->ue_num_drops = 0;
    }

    stprintf(st, "\n");
  }
}


static void
usb_power_state(struct device *dev, device_power_state_t state)
{
  //  struct usb_ctrl *uc = (struct usb_ctrl *)dev;
  if(state == DEVICE_POWER_STATE_SUSPEND) {
    reg_set_bit(USB_CNTR, 0);
    reg_set_bit(USB_CNTR, 2);
    reg_set_bit(USB_CNTR, 1);

  } else {
    clk_enable_hsi48();
    reg_clr_bit(USB_CNTR, 0);
    reg_clr_bit(USB_CNTR, 2);
    reg_clr_bit(USB_CNTR, 1);
  }
}



static const device_class_t stm32g4_otgfs_class = {
  .dc_class_name = "usb",
  .dc_print_info = usb_print_info,
  .dc_power_state = usb_power_state,
};


static void
stm32g4_ep_read(device_t *dev, usb_ep_t *ue,
                uint8_t *buf, size_t buf_size,
                size_t buf_offset, size_t bytes)
{
  const uint32_t ea = ue->ue_address & 0x7f;
  usb_ctrl_t *uc = (usb_ctrl_t *)dev;
  const uint8_t *src = uc->rxbuf[ea];

  for(size_t i = 0; i < bytes; i++) {
    buf[(buf_offset + i) & (buf_size - 1)] = src[i];
  }
}

static int
stm32g4_ep_avail_bytes(device_t *dev, usb_ep_t *ue)
{
  usb_ctrl_t *uc = (usb_ctrl_t *)dev;
  const uint32_t ea = ue->ue_address & 0x7f;

  if(ue->ue_dbl_buf) {
    return __atomic_load_n(&uc->uc_txq[ea], __ATOMIC_RELAXED) < 2 ?
      ue->ue_max_packet_size : 0;
  }

  uint16_t epnr = reg_rd16(USB_EPnR(ea));
  uint16_t state = (epnr >> 4) & 3;
  // If TX is in NAK state (means we've nothing to send) -> say
  // buffer have capacity available
  return state == 2 ? ue->ue_max_packet_size : 0;
}



static void
pma_copy(uint16_t *dst16, const uint8_t *buf, size_t len)
{
  while(len > 1) {
    uint8_t a = *buf++;
    uint8_t b = *buf++;
    uint16_t u16 = (b << 8) | a;
    *dst16++ = u16;
    len -= 2;
  }

  if(len) {
    uint8_t a = *buf++;
    *dst16++ = a;
  }
}


static error_t
stm32g4_ep_write(device_t *dev, usb_ep_t *ue,
                 const uint8_t *buf, size_t len)
{
  usb_ctrl_t *uc = (usb_ctrl_t *)dev;
  const uint32_t ea = ue->ue_address & 0x7f;

  if(ue->ue_dbl_buf) {
    // Fill the buffer indicated by SW_BUF, then hand it to the
    // peripheral by toggling SW_BUF. Occupancy is tracked in
    // uc_txq since the DTOG/SW_BUF pair cannot distinguish
    // "empty" from "both buffers full".
    if(__atomic_load_n(&uc->uc_txq[ea], __ATOMIC_RELAXED) >= 2)
      return ERR_NOT_READY;

    const uint16_t epnr = reg_rd16(USB_EPnR(ea));
    const int sw_buf = (epnr >> 14) & 1;

    reg_wr16(sw_buf ? USB_COUNT_RX(ea) : USB_COUNT_TX(ea), len);
    pma_copy((uint16_t *)(sw_buf ? uc->txbuf1[ea] : uc->txbuf[ea]), buf, len);

    __atomic_fetch_add(&uc->uc_txq[ea], 1, __ATOMIC_RELAXED);
    write_epnr(ea, uc->uc_epreg[ea] | (1 << 14)); // Toggle SW_BUF

    // Re-arm transmission: hardware latches STAT_TX at NAK when it
    // runs out of buffers, and does not recover by itself.
    const uint16_t cur = reg_rd16(USB_EPnR(ea));
    const uint16_t stat = (cur >> 4) & 3;
    if(stat != 3)
      write_epnr(ea, uc->uc_epreg[ea] | ((stat ^ 3) << 4));
    return 0;
  }

  if(stm32g4_ep_avail_bytes(dev, ue) < len)
    return ERR_NOT_READY;

  reg_wr16(USB_COUNT_TX(ea), len);
  pma_copy((uint16_t *)uc->txbuf[ea], buf, len);

  write_epnr(ea, uc->uc_epreg[ea] | (1 << 4)); // TX: NAK -> VALID
  return 0;
}

static void
stm32g4_ep_write1(device_t *dev, usb_ep_t *ue,
                  size_t len, uint8_t (*getu8)(void *opaque), void *opaque)
{
  usb_ctrl_t *uc = (usb_ctrl_t *)dev;
  const uint32_t ea = ue->ue_address & 0x7f;
  reg_wr16(USB_COUNT_TX(ea), len);

  uint16_t *dst16 = (uint16_t *)uc->txbuf[ea];

  while(len > 1) {
    uint8_t a = getu8(opaque);
    uint8_t b = getu8(opaque);
    uint16_t u16 = (b << 8) | a;
    *dst16++ = u16;
    len -= 2;
  }

  if(len) {
    uint8_t a = getu8(opaque);
    *dst16++ = a;
  }

  write_epnr(ea, uc->uc_epreg[ea] | (1 << 4)); // TX: NAK -> VALID
}

static void
stm32g4_ep_cnak(device_t *dev, usb_ep_t *ue)
{
  const uint32_t ea = ue->ue_address & 0x7f;
  usb_ctrl_t *uc = (usb_ctrl_t *)dev;
  write_epnr(ea, uc->uc_epreg[ea] | (1 << 12)); // RX: NAK -> VALID
}


static const usb_ctrl_vtable_t stm32g4_otgfs_vtable =
{
  .read = stm32g4_ep_read,
  .write = stm32g4_ep_write,
  .write1 = stm32g4_ep_write1,
  .cnak = stm32g4_ep_cnak,
  .avail_bytes = stm32g4_ep_avail_bytes,
};


static int
get_ep_type(usb_ctrl_t *uc, int index)
{
  return (uc->uc_epreg[index] >> 9) & 3;
}

static void
set_ep_type(usb_ctrl_t *uc, int index, int type)
{
  uc->uc_epreg[index] = (1 << 15) | (1 << 7) | (type << 9) | index;
}


static int
alloc_ep(usb_ctrl_t *uc, int out, usb_ep_t *ep)
{
  static const uint8_t type_map[4] = {
    [USB_ENDPOINT_CONTROL]    = EP_TYPE_CONTROL,
    [USB_ENDPOINT_BULK]       = EP_TYPE_BULK,
    [USB_ENDPOINT_ISOCHRONUS] = EP_TYPE_ISO,
    [USB_ENDPOINT_INTERRUPT]  = EP_TYPE_INTERRUPT
  };

  const int type = type_map[ep->ue_endpoint_type];
  for(int i = 0; i < MAX_NUM_ENDPOINTS; i++) {
    if(uc->uc_ue[out][i] != NULL)
      continue;

    if(!out && ep->ue_dbl_buf) {
      // Double-buffered endpoints use all four buffer description
      // slots and are forced unidirectional; claim both directions.
      if(uc->uc_ue[1][i] != NULL)
        continue;
      set_ep_type(uc, i, type);
      uc->uc_epreg[i] |= (1 << 8); // EP_KIND = DBL_BUF
      uc->uc_ue[0][i] = ep;
      uc->uc_ue[1][i] = ep;
      return i;
    }

    if(uc->uc_ue[!out][i] == NULL || get_ep_type(uc, i) == type) {
      set_ep_type(uc, i, type);
      uc->uc_ue[out][i] = ep;
      return i;
    }
  }
  panic("usb: Out of endpoints");
}



void
init_interfaces(usb_ctrl_t *uc)
{
  size_t total_desc_size = sizeof(struct usb_config_descriptor);

  usb_interface_t *ui;
  int num_interfaces = 0;

  uint32_t sramptr = 64; // First 64 bytes is the BTABLE

  // Buffers for EP0
  reg_wr16(USB_ADDR_TX(0), sramptr);
  uc->txbuf[0] = (uint8_t *)(intptr_t)USB_SRAM + sramptr;
  sramptr += 8;
  reg_wr16(USB_COUNT_TX(0), 0);
  uc->rxbuf[0] = (uint8_t *)(intptr_t)USB_SRAM + sramptr;
  reg_wr16(USB_ADDR_RX(0), sramptr);
  sramptr += 8;
  reg_wr16(USB_COUNT_RX(0), (4 << 10)); // 8 byte buffer

  STAILQ_FOREACH(ui, &uc->uc_ifaces, ui_link) {
    total_desc_size += ui->ui_gen_desc(NULL, ui->ui_opaque, 0);
    total_desc_size +=
      ui->ui_num_endpoints * sizeof(struct usb_endpoint_descriptor);
    num_interfaces++;
  }

  uc->uc_ud.ud_config_desc_size = total_desc_size;
  uc->uc_ud.ud_config_desc = calloc(1, total_desc_size);
  void *o = uc->uc_ud.ud_config_desc;

