andoma/mios/src/platform/stm32g4/stm32g4_usb.c
  struct usb_config_descriptor *ucd = o;

  ucd->bLength = sizeof(struct usb_config_descriptor);
  ucd->bDescriptorType = USB_DESC_TYPE_CONFIGURATION;
  ucd->wTotalLength = total_desc_size;
  ucd->bNumInterfaces = num_interfaces;
  ucd->bConfigurationValue = 1;
  ucd->bmAttributes = 0xc0; // Self powered
  ucd->bMaxPower = 100 / 2; // 100mW

  o += sizeof(struct usb_config_descriptor);

  int iface_index = 0;

  STAILQ_FOREACH(ui, &uc->uc_ifaces, ui_link) {

    o += ui->ui_gen_desc(o, ui->ui_opaque, iface_index);
    ui->ui_index = iface_index;

    iface_index++;

    for(size_t j = 0; j < ui->ui_num_endpoints; j++)  {
      usb_ep_t *ue = ui->ui_endpoints + j;
      assert(ue->ue_max_packet_size < 2048);
      ue->ue_dev = &uc->uc_ud.ud_dev;
      ue->ue_vtable = &stm32g4_otgfs_vtable;
      ue->ue_name = ui->ui_name;

      const int out = !(ue->ue_address & 0x80);
      const int ea = alloc_ep(uc, out, ue);
      ue->ue_address |= ea;

      struct usb_endpoint_descriptor *ued = o;
      ued->bLength = sizeof(struct usb_endpoint_descriptor);
      ued->bDescriptorType = USB_DESC_TYPE_ENDPOINT;
      ued->bEndpointAddress = ue->ue_address;
      ued->bmAttributes = ue->ue_endpoint_type;
      ued->wMaxPacketSize = ue->ue_max_packet_size;
      ued->bInterval = ue->ue_interval;

      if(out) {
        // RX
        uc->rxbuf[ea] = (uint8_t *)(intptr_t)USB_SRAM + sramptr;
        reg_wr16(USB_ADDR_RX(ea), sramptr);
        int size = ue->ue_max_packet_size;
        if(size > 62) {
          int num_block = (size + 31) / 32;
          reg_wr16(USB_COUNT_RX(ea), 0x8000 | ((num_block - 1) << 10));
          size = num_block * 32;
        } else {
          reg_wr16(USB_COUNT_RX(ea), (size << 10));
        }
        sramptr += size;
      } else {
        uc->txbuf[ea] = (uint8_t *)(intptr_t)USB_SRAM + sramptr;
        reg_wr16(USB_ADDR_TX(ea), sramptr);
        sramptr += ue->ue_max_packet_size;

        if(ue->ue_dbl_buf) {
          // Second TX buffer lives in the RX buffer description slots
          uc->txbuf1[ea] = (uint8_t *)(intptr_t)USB_SRAM + sramptr;
          reg_wr16(USB_ADDR_RX(ea), sramptr);
          sramptr += ue->ue_max_packet_size;
        }
      }

      o += sizeof(struct usb_endpoint_descriptor);
    }
  }

  assert(o == uc->uc_ud.ud_config_desc + uc->uc_ud.ud_config_desc_size);
}



void
stm32g4_usb_create(uint16_t vid, uint16_t pid,
                   const char *manfacturer_string,
                   const char *product_string,
                   struct usb_interface_queue *q)
{
  usb_ctrl_t *uc = &g_usb_ctrl;
  uc->uc_ifaces = *q;
  STAILQ_INIT(q);

  uc->uc_ud.ud_dev.d_class = &stm32g4_otgfs_class;
  uc->uc_ud.ud_dev.d_name = "usb";
  device_register(&uc->uc_ud.ud_dev);

  uc->uc_ud.ud_manufacturer = manfacturer_string;
  uc->uc_ud.ud_product = product_string;

  // Same 12-digit serial as the chip's own DFU bootloader reports, so a
  // board keeps its identity across a DFU cycle (udev rules, tooling
  // that tracks devices by serial): the first 8 digits are UID word 0
  // plus UID word 2, the last 4 are the top half of UID word 1. This
  // is what ST's USB device library does, and what stm32h7_usb.c does.
  const struct serial_number sn = sys_get_serial_number();
  const uint32_t *sn_u32 = sn.data;
  const uint32_t sum = sn_u32[0] + sn_u32[2];
  uint8_t *serial = uc->uc_ud.ud_serial_number;
  serial[0] = sum >> 24;
  serial[1] = sum >> 16;
  serial[2] = sum >> 8;
  serial[3] = sum;
  serial[4] = sn_u32[1] >> 24;
  serial[5] = sn_u32[1] >> 16;

  uc->uc_ud.ud_desc.idVendor = vid;
  uc->uc_ud.ud_desc.idProduct = pid;

  clk_enable(CLK_USB);
  clk_enable_hsi48();

  for(int i = 0; i < 1024; i += 2) {
    reg_wr16(USB_SRAM + i, 0);
  }

  init_interfaces(uc);

  reg_wr(USB_CNTR, 1);
  udelay(1);

  reg_wr(USB_CNTR, 0x9c01);
  reg_wr(USB_BCDR, 0x8000);
  reg_wr(USB_CNTR, 0x9c00);

  irq_enable(19, IRQ_LEVEL_NET);
  irq_enable(20, IRQ_LEVEL_NET);
}


void
stm32g4_usb_disable(int yes)
{
  if(yes) {
    reg_set_bit(USB_CNTR, 1);
  } else {
    reg_clr_bit(USB_CNTR, 1);
  }
}

void
stm32g4_usb_stop(void)
{
  reg_wr(USB_BCDR, 0);
  reg_wr(USB_ISTR, 0);
  reg_wr(USB_DADDR, 0);
  reg_wr(USB_CNTR, 3);
}
